avrdudes/avr-libc/include/avr/ioavr32sd32.h
/* CLKCTRL.OSC32KCTRLA  bit masks and bit positions */
/* CLKCTRL_RUNSTDBY  is already defined. */

/* CLKCTRL.XOSC32KCTRLA  bit masks and bit positions */
#define CLKCTRL_ENABLE_bm  0x01  /* Enable bit mask. */
#define CLKCTRL_ENABLE_bp  0  /* Enable bit position. */
#define CLKCTRL_LPMODE_bm  0x02  /* Low-power Mode bit mask. */
#define CLKCTRL_LPMODE_bp  1  /* Low-power Mode bit position. */
#define CLKCTRL_SEL_bm  0x04  /* Crystal Selection bit mask. */
#define CLKCTRL_SEL_bp  2  /* Crystal Selection bit position. */
#define CLKCTRL_CSUT_gm  0x30  /* Crystal Oscillator Startup Time group mask. */
#define CLKCTRL_CSUT_gp  4  /* Crystal Oscillator Startup Time group position. */
#define CLKCTRL_CSUT_0_bm  (1<<4)  /* Crystal Oscillator Startup Time bit 0 mask. */
#define CLKCTRL_CSUT_0_bp  4  /* Crystal Oscillator Startup Time bit 0 position. */
#define CLKCTRL_CSUT_1_bm  (1<<5)  /* Crystal Oscillator Startup Time bit 1 mask. */
#define CLKCTRL_CSUT_1_bp  5  /* Crystal Oscillator Startup Time bit 1 position. */
/* CLKCTRL_RUNSTDBY  is already defined. */

/* CLKCTRL.XOSCHFCTRLA  bit masks and bit positions */
/* CLKCTRL_ENABLE  is already defined. */
#define CLKCTRL_SELHF_bm  0x02  /* External Source Select bit mask. */
#define CLKCTRL_SELHF_bp  1  /* External Source Select bit position. */
#define CLKCTRL_FRQRANGE_gm  0x0C  /* Frequency Range group mask. */
#define CLKCTRL_FRQRANGE_gp  2  /* Frequency Range group position. */
#define CLKCTRL_FRQRANGE_0_bm  (1<<2)  /* Frequency Range bit 0 mask. */
#define CLKCTRL_FRQRANGE_0_bp  2  /* Frequency Range bit 0 position. */
#define CLKCTRL_FRQRANGE_1_bm  (1<<3)  /* Frequency Range bit 1 mask. */
#define CLKCTRL_FRQRANGE_1_bp  3  /* Frequency Range bit 1 position. */
#define CLKCTRL_CSUTHF_gm  0x30  /* Start-up Time group mask. */
#define CLKCTRL_CSUTHF_gp  4  /* Start-up Time group position. */
#define CLKCTRL_CSUTHF_0_bm  (1<<4)  /* Start-up Time bit 0 mask. */
#define CLKCTRL_CSUTHF_0_bp  4  /* Start-up Time bit 0 position. */
#define CLKCTRL_CSUTHF_1_bm  (1<<5)  /* Start-up Time bit 1 mask. */
#define CLKCTRL_CSUTHF_1_bp  5  /* Start-up Time bit 1 position. */
/* CLKCTRL_RUNSTDBY  is already defined. */


/* CPU - CPU */
/* CPU.CCP  bit masks and bit positions */
#define CPU_CCP_gm  0xFF  /* CCP signature group mask. */
#define CPU_CCP_gp  0  /* CCP signature group position. */
#define CPU_CCP_0_bm  (1<<0)  /* CCP signature bit 0 mask. */
#define CPU_CCP_0_bp  0  /* CCP signature bit 0 position. */
#define CPU_CCP_1_bm  (1<<1)  /* CCP signature bit 1 mask. */
#define CPU_CCP_1_bp  1  /* CCP signature bit 1 position. */
#define CPU_CCP_2_bm  (1<<2)  /* CCP signature bit 2 mask. */
#define CPU_CCP_2_bp  2  /* CCP signature bit 2 position. */
#define CPU_CCP_3_bm  (1<<3)  /* CCP signature bit 3 mask. */
#define CPU_CCP_3_bp  3  /* CCP signature bit 3 position. */
#define CPU_CCP_4_bm  (1<<4)  /* CCP signature bit 4 mask. */
#define CPU_CCP_4_bp  4  /* CCP signature bit 4 position. */
#define CPU_CCP_5_bm  (1<<5)  /* CCP signature bit 5 mask. */
#define CPU_CCP_5_bp  5  /* CCP signature bit 5 position. */
#define CPU_CCP_6_bm  (1<<6)  /* CCP signature bit 6 mask. */
#define CPU_CCP_6_bp  6  /* CCP signature bit 6 position. */
#define CPU_CCP_7_bm  (1<<7)  /* CCP signature bit 7 mask. */
#define CPU_CCP_7_bp  7  /* CCP signature bit 7 position. */

/* CPU.CTRLA  bit masks and bit positions */
#define CPU_SPLOCK_bm  0x01  /* SPLIM Lock bit mask. */
#define CPU_SPLOCK_bp  0  /* SPLIM Lock bit position. */
#define CPU_INJPIC_bm  0x02  /* Inject Parity Error on Instruction Bus Control bit mask. */
#define CPU_INJPIC_bp  1  /* Inject Parity Error on Instruction Bus Control bit position. */
#define CPU_INJPIA_bm  0x04  /* Inject Parity Error on Instruction Bus Address bit mask. */
#define CPU_INJPIA_bp  2  /* Inject Parity Error on Instruction Bus Address bit position. */
#define CPU_INJPDC_bm  0x08  /* Inject Parity Error on Data Bus Control bit mask. */
#define CPU_INJPDC_bp  3  /* Inject Parity Error on Data Bus Control bit position. */
#define CPU_INJPDA_bm  0x10  /* Inject Parity Error on Data Bus Address bit mask. */
#define CPU_INJPDA_bp  4  /* Inject Parity Error on Data Bus Address bit position. */
#define CPU_INJPDD_bm  0x20  /* Inject Parity Error on Data Bus Data bit mask. */
#define CPU_INJPDD_bp  5  /* Inject Parity Error on Data Bus Data bit position. */
#define CPU_INJCOMP_bm  0x40  /* Inject Comparator Error bit mask. */
#define CPU_INJCOMP_bp  6  /* Inject Comparator Error bit position. */
#define CPU_NMIDIS_bm  0x80  /* Disable NMI Request bit mask. */
#define CPU_NMIDIS_bp  7  /* Disable NMI Request bit position. */

/* CPU.INTFLAGS  bit masks and bit positions */
#define CPU_OPC_bm  0x01  /* Illegal Opcode Error bit mask. */
#define CPU_OPC_bp  0  /* Illegal Opcode Error bit position. */
#define CPU_BUSERR_bm  0x02  /* Bus Error bit mask. */
#define CPU_BUSERR_bp  1  /* Bus Error bit position. */
#define CPU_SPLIM_bm  0x04  /* Stack Pointer Limit Error bit mask. */
#define CPU_SPLIM_bp  2  /* Stack Pointer Limit Error bit position. */
#define CPU_PARITYD_bm  0x08  /* Parity Error on Data Bus bit mask. */
#define CPU_PARITYD_bp  3  /* Parity Error on Data Bus bit position. */
#define CPU_PARITYI_bm  0x10  /* Parity Error on Instruction Bus bit mask. */
#define CPU_PARITYI_bp  4  /* Parity Error on Instruction Bus bit position. */

/* CPU.SREG  bit masks and bit positions */
#define CPU_C_bm  0x01  /* Carry Flag bit mask. */
#define CPU_C_bp  0  /* Carry Flag bit position. */
#define CPU_Z_bm  0x02  /* Zero Flag bit mask. */
#define CPU_Z_bp  1  /* Zero Flag bit position. */
#define CPU_N_bm  0x04  /* Negative Flag bit mask. */
#define CPU_N_bp  2  /* Negative Flag bit position. */
#define CPU_V_bm  0x08  /* Two's Complement Overflow Flag bit mask. */
#define CPU_V_bp  3  /* Two's Complement Overflow Flag bit position. */
#define CPU_S_bm  0x10  /* N Exclusive Or V Flag bit mask. */
#define CPU_S_bp  4  /* N Exclusive Or V Flag bit position. */
#define CPU_H_bm  0x20  /* Half Carry Flag bit mask. */
#define CPU_H_bp  5  /* Half Carry Flag bit position. */
#define CPU_T_bm  0x40  /* Transfer Bit bit mask. */
#define CPU_T_bp  6  /* Transfer Bit bit position. */
#define CPU_I_bm  0x80  /* Global Interrupt Enable Flag bit mask. */
#define CPU_I_bp  7  /* Global Interrupt Enable Flag bit position. */


