avrdudes/avr-libc/include/avr/ioavr32sd32.h
/* SLPCTRL - Sleep Controller */
/* SLPCTRL.CTRLA  bit masks and bit positions */
#define SLPCTRL_SEN_bm  0x01  /* Sleep enable bit mask. */
#define SLPCTRL_SEN_bp  0  /* Sleep enable bit position. */
#define SLPCTRL_SMODE_gm  0x0E  /* Sleep mode group mask. */
#define SLPCTRL_SMODE_gp  1  /* Sleep mode group position. */
#define SLPCTRL_SMODE_0_bm  (1<<1)  /* Sleep mode bit 0 mask. */
#define SLPCTRL_SMODE_0_bp  1  /* Sleep mode bit 0 position. */
#define SLPCTRL_SMODE_1_bm  (1<<2)  /* Sleep mode bit 1 mask. */
#define SLPCTRL_SMODE_1_bp  2  /* Sleep mode bit 1 position. */
#define SLPCTRL_SMODE_2_bm  (1<<3)  /* Sleep mode bit 2 mask. */
#define SLPCTRL_SMODE_2_bp  3  /* Sleep mode bit 2 position. */

/* SLPCTRL.CTRLB  bit masks and bit positions */
#define SLPCTRL_DMODE_gm  0x03  /* VMON Diagnostic Mode group mask. */
#define SLPCTRL_DMODE_gp  0  /* VMON Diagnostic Mode group position. */
#define SLPCTRL_DMODE_0_bm  (1<<0)  /* VMON Diagnostic Mode bit 0 mask. */
#define SLPCTRL_DMODE_0_bp  0  /* VMON Diagnostic Mode bit 0 position. */
#define SLPCTRL_DMODE_1_bm  (1<<1)  /* VMON Diagnostic Mode bit 1 mask. */
#define SLPCTRL_DMODE_1_bp  1  /* VMON Diagnostic Mode bit 1 position. */

/* SLPCTRL.VREGCTRL  bit masks and bit positions */
#define SLPCTRL_PMODE_gm  0x07  /* Performance Mode group mask. */
#define SLPCTRL_PMODE_gp  0  /* Performance Mode group position. */
#define SLPCTRL_PMODE_0_bm  (1<<0)  /* Performance Mode bit 0 mask. */
#define SLPCTRL_PMODE_0_bp  0  /* Performance Mode bit 0 position. */
#define SLPCTRL_PMODE_1_bm  (1<<1)  /* Performance Mode bit 1 mask. */
#define SLPCTRL_PMODE_1_bp  1  /* Performance Mode bit 1 position. */
#define SLPCTRL_PMODE_2_bm  (1<<2)  /* Performance Mode bit 2 mask. */
#define SLPCTRL_PMODE_2_bp  2  /* Performance Mode bit 2 position. */
#define SLPCTRL_VMONSEN_bm  0x40  /* VMON Sleep Mode Enable bit mask. */
#define SLPCTRL_VMONSEN_bp  6  /* VMON Sleep Mode Enable bit position. */

/* SLPCTRL.INTCTRL  bit masks and bit positions */
#define SLPCTRL_SERR_bm  0x01  /* Sleep Error bit mask. */
#define SLPCTRL_SERR_bp  0  /* Sleep Error bit position. */
#define SLPCTRL_VDIS_bm  0x02  /* VMON is Disabled bit mask. */
#define SLPCTRL_VDIS_bp  1  /* VMON is Disabled bit position. */
#define SLPCTRL_VSLP_bm  0x04  /* VMON is in Sleep Mode bit mask. */
#define SLPCTRL_VSLP_bp  2  /* VMON is in Sleep Mode bit position. */
#define SLPCTRL_VERR_bm  0x08  /* VMON Error bit mask. */
#define SLPCTRL_VERR_bp  3  /* VMON Error bit position. */
#define SLPCTRL_VDEXIT_bm  0x10  /* VMON Diagnostic Mode Exit bit mask. */
#define SLPCTRL_VDEXIT_bp  4  /* VMON Diagnostic Mode Exit bit position. */
#define SLPCTRL_VDENTER_bm  0x20  /* VMON Diagnostic Mode Enter bit mask. */
#define SLPCTRL_VDENTER_bp  5  /* VMON Diagnostic Mode Enter bit position. */
#define SLPCTRL_VUV_bm  0x40  /* VMON Undervoltage Detected bit mask. */
#define SLPCTRL_VUV_bp  6  /* VMON Undervoltage Detected bit position. */
#define SLPCTRL_VOV_bm  0x80  /* VMON Overvoltage Detected bit mask. */
#define SLPCTRL_VOV_bp  7  /* VMON Overvoltage Detected bit position. */

/* SLPCTRL.INTFLAGS  bit masks and bit positions */
/* SLPCTRL_SERR  is already defined. */
/* SLPCTRL_VDIS  is already defined. */
/* SLPCTRL_VSLP  is already defined. */
/* SLPCTRL_VERR  is already defined. */
/* SLPCTRL_VDEXIT  is already defined. */
/* SLPCTRL_VDENTER  is already defined. */
/* SLPCTRL_VUV  is already defined. */
/* SLPCTRL_VOV  is already defined. */


/* SPI - Serial Peripheral Interface */
/* SPI.CTRLA  bit masks and bit positions */
#define SPI_ENABLE_bm  0x01  /* Enable Module bit mask. */
#define SPI_ENABLE_bp  0  /* Enable Module bit position. */
#define SPI_PRESC_gm  0x06  /* Prescaler group mask. */
#define SPI_PRESC_gp  1  /* Prescaler group position. */
#define SPI_PRESC_0_bm  (1<<1)  /* Prescaler bit 0 mask. */
#define SPI_PRESC_0_bp  1  /* Prescaler bit 0 position. */
#define SPI_PRESC_1_bm  (1<<2)  /* Prescaler bit 1 mask. */
#define SPI_PRESC_1_bp  2  /* Prescaler bit 1 position. */
#define SPI_CLK2X_bm  0x10  /* Enable Double Speed bit mask. */
#define SPI_CLK2X_bp  4  /* Enable Double Speed bit position. */
#define SPI_MASTER_bm  0x20  /* Host Operation Enable bit mask. */
#define SPI_MASTER_bp  5  /* Host Operation Enable bit position. */
#define SPI_DORD_bm  0x40  /* Data Order Setting bit mask. */
#define SPI_DORD_bp  6  /* Data Order Setting bit position. */

/* SPI.CTRLB  bit masks and bit positions */
#define SPI_MODE_gm  0x03  /* SPI Mode group mask. */
#define SPI_MODE_gp  0  /* SPI Mode group position. */
#define SPI_MODE_0_bm  (1<<0)  /* SPI Mode bit 0 mask. */
#define SPI_MODE_0_bp  0  /* SPI Mode bit 0 position. */
#define SPI_MODE_1_bm  (1<<1)  /* SPI Mode bit 1 mask. */
#define SPI_MODE_1_bp  1  /* SPI Mode bit 1 position. */
#define SPI_SSD_bm  0x04  /* SPI Select Disable bit mask. */
#define SPI_SSD_bp  2  /* SPI Select Disable bit position. */
#define SPI_BUFWR_bm  0x40  /* Buffer Mode Wait for Receive bit mask. */
#define SPI_BUFWR_bp  6  /* Buffer Mode Wait for Receive bit position. */
#define SPI_BUFEN_bm  0x80  /* Buffer Mode Enable bit mask. */
#define SPI_BUFEN_bp  7  /* Buffer Mode Enable bit position. */

/* SPI.INTCTRL  bit masks and bit positions */
#define SPI_IE_bm  0x01  /* Interrupt Enable bit mask. */
#define SPI_IE_bp  0  /* Interrupt Enable bit position. */
#define SPI_SSIE_bm  0x10  /* SPI Select Trigger Interrupt Enable bit mask. */
#define SPI_SSIE_bp  4  /* SPI Select Trigger Interrupt Enable bit position. */
#define SPI_DREIE_bm  0x20  /* Data Register Empty Interrupt Enable bit mask. */
#define SPI_DREIE_bp  5  /* Data Register Empty Interrupt Enable bit position. */
#define SPI_TXCIE_bm  0x40  /* Transfer Complete Interrupt Enable bit mask. */
#define SPI_TXCIE_bp  6  /* Transfer Complete Interrupt Enable bit position. */
#define SPI_RXCIE_bm  0x80  /* Receive Complete Interrupt Enable bit mask. */
#define SPI_RXCIE_bp  7  /* Receive Complete Interrupt Enable bit position. */

/* SPI.INTFLAGS  bit masks and bit positions */
#define SPI_BUFOVF_bm  0x01  /* Buffer Overflow bit mask. */
#define SPI_BUFOVF_bp  0  /* Buffer Overflow bit position. */
#define SPI_SSIF_bm  0x10  /* SPI Select Trigger Interrupt Flag bit mask. */
#define SPI_SSIF_bp  4  /* SPI Select Trigger Interrupt Flag bit position. */
#define SPI_DREIF_bm  0x20  /* Data Register Empty Interrupt Flag bit mask. */
#define SPI_DREIF_bp  5  /* Data Register Empty Interrupt Flag bit position. */
#define SPI_TXCIF_bm  0x40  /* Transfer Complete Interrupt Flag bit mask. */
#define SPI_TXCIF_bp  6  /* Transfer Complete Interrupt Flag bit position. */
#define SPI_WRCOL_bm  0x40  /* Write Collision bit mask. */
#define SPI_WRCOL_bp  6  /* Write Collision bit position. */
#define SPI_RXCIF_bm  0x80  /* Receive Complete Interrupt Flag bit mask. */
#define SPI_RXCIF_bp  7  /* Receive Complete Interrupt Flag bit position. */
#define SPI_IF_bm  0x80  /* Interrupt Flag bit mask. */
#define SPI_IF_bp  7  /* Interrupt Flag bit position. */


/* SWDT - Synchronous Watchdog Timer */
/* SWDT.CTRLA  bit masks and bit positions */
#define SWDT_ENABLE_bm  0x01  /* Peripheral Enable bit mask. */
#define SWDT_ENABLE_bp  0  /* Peripheral Enable bit position. */
#define SWDT_MODE_bm  0x02  /* Peripheral Mode bit mask. */
#define SWDT_MODE_bp  1  /* Peripheral Mode bit position. */
#define SWDT_LOCK_bm  0x04  /* Register Lock bit mask. */
#define SWDT_LOCK_bp  2  /* Register Lock bit position. */
#define SWDT_CCP_bm  0x08  /* SWDT Register Lock bit mask. */
#define SWDT_CCP_bp  3  /* SWDT Register Lock bit position. */

/* SWDT.CTRLB  bit masks and bit positions */
#define SWDT_TEST_bm  0x01  /* Test bit mask. */
#define SWDT_TEST_bp  0  /* Test bit position. */

/* SWDT.INTCTRL  bit masks and bit positions */
#define SWDT_ERROR_bm  0x08  /* SWDT Error interrupt enable bit mask. */
#define SWDT_ERROR_bp  3  /* SWDT Error interrupt enable bit position. */

