avrdudes/avr-libc/include/avr/ioavr32sd32.h
/* Noncritical Error Detected select bit group configurations*/
typedef enum ERRCTRL_NONCRITICAL_enum
{
    ERRCTRL_NONCRITICAL_NOERROR_gc = (ERRCTRL_NONCRITICAL_NOERROR_gv << ERRCTRL_NONCRITICAL_bp),  /* There are no Noncritical errors in the system */
    ERRCTRL_NONCRITICAL_ERROR_gc   = (ERRCTRL_NONCRITICAL_ERROR_gv << ERRCTRL_NONCRITICAL_bp)   /* There are one or more Noncritical errors in the system */
} ERRCTRL_NONCRITICAL_t;

/* Notification Error Detected select bit group values */
typedef enum ERRCTRL_NOTIFICATION_VALUES_enum
{
    ERRCTRL_NOTIFICATION_NOERROR_gv = 0x00,  /* There are no Notification errors in the system */
    ERRCTRL_NOTIFICATION_ERROR_gv  = 0x01   /* There are one or more Notification errors in the system */
} ERRCTRL_NOTIFICATION_values_t;

/* Notification Error Detected select bit group configurations*/
typedef enum ERRCTRL_NOTIFICATION_enum
{
    ERRCTRL_NOTIFICATION_NOERROR_gc = (ERRCTRL_NOTIFICATION_NOERROR_gv << ERRCTRL_NOTIFICATION_bp),  /* There are no Notification errors in the system */
    ERRCTRL_NOTIFICATION_ERROR_gc  = (ERRCTRL_NOTIFICATION_ERROR_gv << ERRCTRL_NOTIFICATION_bp)   /* There are one or more Notification errors in the system */
} ERRCTRL_NOTIFICATION_t;

/* ERRCTRL State select bit group values */
typedef enum ERRCTRL_STATE_VALUES_enum
{
    ERRCTRL_STATE_CONFIG_gv        = 0x00,  /* Configuration state */
    ERRCTRL_STATE_NORMAL_gv        = 0x01,  /* Normal state */
    ERRCTRL_STATE_ALARM_gv         = 0x02,  /* Alarm state */
    ERRCTRL_STATE_FAULT_gv         = 0x03   /* Fault state */
} ERRCTRL_STATE_values_t;

/* ERRCTRL State select bit group configurations*/
typedef enum ERRCTRL_STATE_enum
{
    ERRCTRL_STATE_CONFIG_gc        = (ERRCTRL_STATE_CONFIG_gv << ERRCTRL_STATE_gp),  /* Configuration state */
    ERRCTRL_STATE_NORMAL_gc        = (ERRCTRL_STATE_NORMAL_gv << ERRCTRL_STATE_gp),  /* Normal state */
    ERRCTRL_STATE_ALARM_gc         = (ERRCTRL_STATE_ALARM_gv << ERRCTRL_STATE_gp),  /* Alarm state */
    ERRCTRL_STATE_FAULT_gc         = (ERRCTRL_STATE_FAULT_gv << ERRCTRL_STATE_gp)   /* Fault state */
} ERRCTRL_STATE_t;

/*
--------------------------------------------------------------------------
EVSYS - Event System
--------------------------------------------------------------------------
*/

/* Event System */
typedef struct EVSYS_struct
{
    register8_t SWEVENTA;  /* Software Event A */
    register8_t reserved_1[15];
    register8_t CHANNEL0;  /* Multiplexer Channel 0 */
    register8_t CHANNEL1;  /* Multiplexer Channel 1 */
    register8_t CHANNEL2;  /* Multiplexer Channel 2 */
    register8_t CHANNEL3;  /* Multiplexer Channel 3 */
    register8_t CHANNEL4;  /* Multiplexer Channel 4 */
    register8_t CHANNEL5;  /* Multiplexer Channel 5 */
    register8_t reserved_2[10];
    register8_t USERCCLLUT0A;  /* User 0 - CCL LUT0 Event A */
    register8_t USERCCLLUT0B;  /* User 1 - CCL LUT0 Event B */
    register8_t USERCCLLUT1A;  /* User 2 - CCL LUT1 Event A */
    register8_t USERCCLLUT1B;  /* User 3 - CCL LUT1 Event B */
    register8_t USERCCLLUT2A;  /* User 4 - CCL LUT2 Event A */
    register8_t USERCCLLUT2B;  /* User 5 - CCL LUT2 Event B */
    register8_t USERCCLLUT3A;  /* User 6 - CCL LUT3 Event A */
    register8_t USERCCLLUT3B;  /* User 7 - CCL LUT3 Event B */
    register8_t USERCCLLUT4A;  /* User 8 - CCL LUT4 Event A */
    register8_t USERCCLLUT4B;  /* User 9 - CCL LUT4 Event B */
    register8_t USERCCLLUT5A;  /* User 10 - CCL LUT5 Event A */
    register8_t USERCCLLUT5B;  /* User 11 - CCL LUT5 Event B */
    register8_t USERADC0START;  /* User 12 - ADC0 */
    register8_t USERADC1START;  /* User 13 - ADC1 */
    register8_t USEREVSYSEVOUTA;  /* User 14 - EVOUTA */
    register8_t USEREVSYSEVOUTC;  /* User 15 - EVOUTC */
    register8_t USEREVSYSEVOUTD;  /* User 16 - EVOUTD */
    register8_t USEREVSYSEVOUTF;  /* User 17 - EVOUTF */
    register8_t USERUSART0IRDA;  /* User 18 - USART0 */
    register8_t USERUSART1IRDA;  /* User 19 - USART1 */
    register8_t USERUSART2IRDA;  /* User 20 - USART2 */
    register8_t USERTCA0CNTA;  /* User 21 - TCA0 Event A */
    register8_t USERTCA0CNTB;  /* User 22 - TCA0 Event B */
    register8_t USERTCB0CAPT;  /* User 23 - TCB0 Event A */
    register8_t USERTCB0COUNT;  /* User 24 - TCB0 Event B */
    register8_t USERTCB1CAPT;  /* User 25 - TCB1 Event A */
    register8_t USERTCB1COUNT;  /* User 26 - TCB1 Event B */
    register8_t USERTCB2CAPT;  /* User 27 - TCB2 Event A */
    register8_t USERTCB2COUNT;  /* User 28 - TCB2 Event B */
    register8_t USERTCB3CAPT;  /* User 29 - TCB3 Event A */
    register8_t USERTCB3COUNT;  /* User 30 - TCB3 Event B */
    register8_t USERTCD0INPUTA;  /* User 31 - TCD0 Event A */
    register8_t USERTCD0INPUTB;  /* User 32 - TCD0 Event B */
    register8_t USERERRCTRLEVENT0;  /* User 33 - ERRCTRL Event 0 */
    register8_t USERERRCTRLEVENT1;  /* User 34 - ERRCTRL Event 1 */
    register8_t USERCLKCTRLCFD;  /* User 35 - CLKCTRL CFD */
    register8_t USERCLKCTRLCFM;  /* User 36 - CLKCTRL CFM */
    register8_t reserved_3[59];
} EVSYS_t;

/* Channel Generator Select bit group values */
typedef enum EVSYS_CHANNEL_VALUES_enum
{
    EVSYS_CHANNEL_OFF_gv           = 0x00,  /* Off */
    EVSYS_CHANNEL_UPDI_SYNCH_gv    = 0x01,  /* UPDI SYNCH character */
    EVSYS_CHANNEL_WDT_TICK_gv      = 0x03,  /* WDT LSB Tick */
    EVSYS_CHANNEL_SWDT_ERROR_gv    = 0x04,  /* SWDT Error */
    EVSYS_CHANNEL_MVIO_VDDIO2OK_gv = 0x05,  /* VDDIO2 OK */
    EVSYS_CHANNEL_RTC_OVF_gv       = 0x06,  /* Real Time Counter overflow */
    EVSYS_CHANNEL_RTC_CMP_gv       = 0x07,  /* Real Time Counter compare */
    EVSYS_CHANNEL_RTC_EVGEN0_gv    = 0x08,  /* Event output 0 */
    EVSYS_CHANNEL_RTC_EVGEN1_gv    = 0x09,  /* Event output 1 */
    EVSYS_CHANNEL_CCL_LUT0_gv      = 0x10,  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL_CCL_LUT1_gv      = 0x11,  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL_CCL_LUT2_gv      = 0x12,  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL_CCL_LUT3_gv      = 0x13,  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL_CCL_LUT4_gv      = 0x14,  /* Configurable Custom Logic LUT4 */
    EVSYS_CHANNEL_CCL_LUT5_gv      = 0x15,  /* Configurable Custom Logic LUT5 */
    EVSYS_CHANNEL_AC0_OUT_gv       = 0x20,  /* Analog Comparator 0 out */
    EVSYS_CHANNEL_AC1_OUT_gv       = 0x21,  /* Analog Comparator 1 out */
    EVSYS_CHANNEL_AC2_OUT_gv       = 0x22,  /* Analog Comparator 2 out */
    EVSYS_CHANNEL_ADC0_RESRDY_gv   = 0x24,  /* ADC 0 Result Ready */
    EVSYS_CHANNEL_ADC0_SAMPRDY_gv  = 0x25,  /* ADC 0 Sample Ready */
    EVSYS_CHANNEL_ADC0_WCMP_gv     = 0x26,  /* ADC 0 Window Comparator */
    EVSYS_CHANNEL_ADC1_RESRDY_gv   = 0x27,  /* ADC 1 Result Ready */
    EVSYS_CHANNEL_ADC1_SAMPRDY_gv  = 0x28,  /* ADC 1 Sample Ready */
    EVSYS_CHANNEL_ADC1_WCMP_gv     = 0x29,  /* ADC 1 Window Comparator */
    EVSYS_CHANNEL_ZCD0_OUT_gv      = 0x30,  /* Zero Cross Detect 0 out */
    EVSYS_CHANNEL_ZCD3_OUT_gv      = 0x33,  /* Zero Cross Detect 3 out */
    EVSYS_CHANNEL_PORTA_EVGEN0_gv  = 0x40,  /* Port A Event 0 */
    EVSYS_CHANNEL_PORTA_EVGEN1_gv  = 0x41,  /* Port A Event 1 */
    EVSYS_CHANNEL_PORTC_EVGEN0_gv  = 0x44,  /* Port C Event 0 */
    EVSYS_CHANNEL_PORTC_EVGEN1_gv  = 0x45,  /* Port C Event 1 */
    EVSYS_CHANNEL_PORTD_EVGEN0_gv  = 0x46,  /* Port D Event 0 */
    EVSYS_CHANNEL_PORTD_EVGEN1_gv  = 0x47,  /* Port D Event 1 */
    EVSYS_CHANNEL_PORTF_EVGEN0_gv  = 0x4A,  /* Port F Event 0 */
    EVSYS_CHANNEL_PORTF_EVGEN1_gv  = 0x4B,  /* Port F Event 1 */
    EVSYS_CHANNEL_USART0_XCK_gv    = 0x60,  /* USART 0 XCK */
    EVSYS_CHANNEL_USART1_XCK_gv    = 0x61,  /* USART 1 XCK */
    EVSYS_CHANNEL_USART2_XCK_gv    = 0x62,  /* USART 2 XCK */
    EVSYS_CHANNEL_SPI0_SCK_gv      = 0x68,  /* SPI 0 SCK */
    EVSYS_CHANNEL_SPI1_SCK_gv      = 0x69,  /* SPI 1 SCK */
    EVSYS_CHANNEL_TCA0_OVF_LUNF_gv = 0x80,  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL_TCA0_HUNF_gv     = 0x81,  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL_TCA0_CMP0_LCMP0_gv = 0x84,  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL_TCA0_CMP1_LCMP1_gv = 0x85,  /* Timer/Counter A0 compare 0 / low byte timer compare 1 */
    EVSYS_CHANNEL_TCA0_CMP2_LCMP2_gv = 0x86,  /* Timer/Counter A0 compare 0 / low byte timer compare 2 */
    EVSYS_CHANNEL_TCB0_CAPT_gv     = 0xA0,  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL_TCB0_OVF_gv      = 0xA1,  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL_TCB1_CAPT_gv     = 0xA2,  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL_TCB1_OVF_gv      = 0xA3,  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL_TCB2_CAPT_gv     = 0xA4,  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL_TCB2_OVF_gv      = 0xA5,  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL_TCB3_CAPT_gv     = 0xA6,  /* Timer/Counter B3 capture */
    EVSYS_CHANNEL_TCB3_OVF_gv      = 0xA7,  /* Timer/Counter B3 overflow */
    EVSYS_CHANNEL_TCD0_CMPBCLR_gv  = 0xB0,  /* Counter matches CMPBCLR */
    EVSYS_CHANNEL_TCD0_CMPASET_gv  = 0xB1,  /* Counter matches CMPASET */
    EVSYS_CHANNEL_TCD0_CMPBSET_gv  = 0xB2,  /* Counter matches CMPBSET */
    EVSYS_CHANNEL_TCD0_PROGEV_gv   = 0xB3   /* Programmable event output */
} EVSYS_CHANNEL_values_t;

