avrdudes/avr-libc/include/avr/ioavr32sd32.h
/* TCB3 Output select bit group configurations*/
typedef enum PORTMUX_TCB3_enum
{
    PORTMUX_TCB3_DEFAULT_gc        = (PORTMUX_TCB3_DEFAULT_gv << PORTMUX_TCB3_bp),  /* Not connected to any pins */
    PORTMUX_TCB3_ALT1_gc           = (PORTMUX_TCB3_ALT1_gv << PORTMUX_TCB3_bp)   /* WO on PC1 */
} PORTMUX_TCB3_t;

/* TCD0 Signals select bit group values */
typedef enum PORTMUX_TCD0_VALUES_enum
{
    PORTMUX_TCD0_DEFAULT_gv        = 0x00,  /* PA4, PA5, PA6, PA7 */
    PORTMUX_TCD0_ALT2_gv           = 0x02,  /* PF0, PF1, PF2, PF3 */
    PORTMUX_TCD0_ALT4_gv           = 0x04   /* PA4, PA5, PD4, PD5 */
} PORTMUX_TCD0_values_t;

/* TCD0 Signals select bit group configurations*/
typedef enum PORTMUX_TCD0_enum
{
    PORTMUX_TCD0_DEFAULT_gc        = (PORTMUX_TCD0_DEFAULT_gv << PORTMUX_TCD0_gp),  /* PA4, PA5, PA6, PA7 */
    PORTMUX_TCD0_ALT2_gc           = (PORTMUX_TCD0_ALT2_gv << PORTMUX_TCD0_gp),  /* PF0, PF1, PF2, PF3 */
    PORTMUX_TCD0_ALT4_gc           = (PORTMUX_TCD0_ALT4_gv << PORTMUX_TCD0_gp)   /* PA4, PA5, PD4, PD5 */
} PORTMUX_TCD0_t;

/* TWI0 Signals select bit group values */
typedef enum PORTMUX_TWI0_VALUES_enum
{
    PORTMUX_TWI0_DEFAULT_gv        = 0x00,  /* PA2, PA3, PC2, PC3 */
    PORTMUX_TWI0_ALT1_gv           = 0x01,  /* PA2, PA3, -, - */
    PORTMUX_TWI0_ALT2_gv           = 0x02,  /* PC2, PC3, -, - */
    PORTMUX_TWI0_ALT3_gv           = 0x03   /* PA0, PA1, PC2, PC3 */
} PORTMUX_TWI0_values_t;

/* TWI0 Signals select bit group configurations*/
typedef enum PORTMUX_TWI0_enum
{
    PORTMUX_TWI0_DEFAULT_gc        = (PORTMUX_TWI0_DEFAULT_gv << PORTMUX_TWI0_gp),  /* PA2, PA3, PC2, PC3 */
    PORTMUX_TWI0_ALT1_gc           = (PORTMUX_TWI0_ALT1_gv << PORTMUX_TWI0_gp),  /* PA2, PA3, -, - */
    PORTMUX_TWI0_ALT2_gc           = (PORTMUX_TWI0_ALT2_gv << PORTMUX_TWI0_gp),  /* PC2, PC3, -, - */
    PORTMUX_TWI0_ALT3_gc           = (PORTMUX_TWI0_ALT3_gv << PORTMUX_TWI0_gp)   /* PA0, PA1, PC2, PC3 */
} PORTMUX_TWI0_t;

/* TWI1 Signals select bit group values */
typedef enum PORTMUX_TWI1_VALUES_enum
{
    PORTMUX_TWI1_DEFAULT_gv        = 0x00,  /* PF2, PF3, -, - */
    PORTMUX_TWI1_ALT1_gv           = 0x01   /* PF2, PF3, -, - */
} PORTMUX_TWI1_values_t;

/* TWI1 Signals select bit group configurations*/
typedef enum PORTMUX_TWI1_enum
{
    PORTMUX_TWI1_DEFAULT_gc        = (PORTMUX_TWI1_DEFAULT_gv << PORTMUX_TWI1_gp),  /* PF2, PF3, -, - */
    PORTMUX_TWI1_ALT1_gc           = (PORTMUX_TWI1_ALT1_gv << PORTMUX_TWI1_gp)   /* PF2, PF3, -, - */
} PORTMUX_TWI1_t;

/* USART0 Signals select bit group values */
typedef enum PORTMUX_USART0_VALUES_enum
{
    PORTMUX_USART0_DEFAULT_gv      = 0x00,  /* PA0, PA1, PA2, PA3 */
    PORTMUX_USART0_ALT1_gv         = 0x01,  /* PA4, PA5, PA6, PA7 */
    PORTMUX_USART0_ALT2_gv         = 0x02,  /* PA2, PA3 */
    PORTMUX_USART0_ALT3_gv         = 0x03,  /* PD4, PD5, PD6, PD7 */
    PORTMUX_USART0_ALT4_gv         = 0x04,  /* PC1, PC2, PC3 */
    PORTMUX_USART0_NONE_gv         = 0x05   /* Not connected to any pins */
} PORTMUX_USART0_values_t;

/* USART0 Signals select bit group configurations*/
typedef enum PORTMUX_USART0_enum
{
    PORTMUX_USART0_DEFAULT_gc      = (PORTMUX_USART0_DEFAULT_gv << PORTMUX_USART0_gp),  /* PA0, PA1, PA2, PA3 */
    PORTMUX_USART0_ALT1_gc         = (PORTMUX_USART0_ALT1_gv << PORTMUX_USART0_gp),  /* PA4, PA5, PA6, PA7 */
    PORTMUX_USART0_ALT2_gc         = (PORTMUX_USART0_ALT2_gv << PORTMUX_USART0_gp),  /* PA2, PA3 */
    PORTMUX_USART0_ALT3_gc         = (PORTMUX_USART0_ALT3_gv << PORTMUX_USART0_gp),  /* PD4, PD5, PD6, PD7 */
    PORTMUX_USART0_ALT4_gc         = (PORTMUX_USART0_ALT4_gv << PORTMUX_USART0_gp),  /* PC1, PC2, PC3 */
    PORTMUX_USART0_NONE_gc         = (PORTMUX_USART0_NONE_gv << PORTMUX_USART0_gp)   /* Not connected to any pins */
} PORTMUX_USART0_t;

/* USART1 Signals select bit group values */
typedef enum PORTMUX_USART1_VALUES_enum
{
    PORTMUX_USART1_DEFAULT_gv      = 0x00,  /* PC0, PC1, PC2, PC3 */
    PORTMUX_USART1_ALT2_gv         = 0x02,  /* PD6, PD7 */
    PORTMUX_USART1_NONE_gv         = 0x03   /* Not connected to any pins */
} PORTMUX_USART1_values_t;

/* USART1 Signals select bit group configurations*/
typedef enum PORTMUX_USART1_enum
{
    PORTMUX_USART1_DEFAULT_gc      = (PORTMUX_USART1_DEFAULT_gv << PORTMUX_USART1_gp),  /* PC0, PC1, PC2, PC3 */
    PORTMUX_USART1_ALT2_gc         = (PORTMUX_USART1_ALT2_gv << PORTMUX_USART1_gp),  /* PD6, PD7 */
    PORTMUX_USART1_NONE_gc         = (PORTMUX_USART1_NONE_gv << PORTMUX_USART1_gp)   /* Not connected to any pins */
} PORTMUX_USART1_t;

/* USART2 Signals select bit group values */
typedef enum PORTMUX_USART2_VALUES_enum
{
    PORTMUX_USART2_DEFAULT_gv      = 0x00,  /* PF0, PF1, PF2, PF3 */
    PORTMUX_USART2_ALT1_gv         = 0x01,  /* PF4, PF5 */
    PORTMUX_USART2_NONE_gv         = 0x03   /* Not connected to any pins */
} PORTMUX_USART2_values_t;

/* USART2 Signals select bit group configurations*/
typedef enum PORTMUX_USART2_enum
{
    PORTMUX_USART2_DEFAULT_gc      = (PORTMUX_USART2_DEFAULT_gv << PORTMUX_USART2_gp),  /* PF0, PF1, PF2, PF3 */
    PORTMUX_USART2_ALT1_gc         = (PORTMUX_USART2_ALT1_gv << PORTMUX_USART2_gp),  /* PF4, PF5 */
    PORTMUX_USART2_NONE_gc         = (PORTMUX_USART2_NONE_gv << PORTMUX_USART2_gp)   /* Not connected to any pins */
} PORTMUX_USART2_t;

/* Zero Cross Detector 0 Output select bit group values */
typedef enum PORTMUX_ZCD0_VALUES_enum
{
    PORTMUX_ZCD0_DEFAULT_gv        = 0x00   /* OUT on PA7 */
} PORTMUX_ZCD0_values_t;

/* Zero Cross Detector 0 Output select bit group configurations*/
typedef enum PORTMUX_ZCD0_enum
{
    PORTMUX_ZCD0_DEFAULT_gc        = (PORTMUX_ZCD0_DEFAULT_gv << PORTMUX_ZCD0_bp)   /* OUT on PA7 */
} PORTMUX_ZCD0_t;

/* Zero Cross Detector 3 Output select bit group values */
typedef enum PORTMUX_ZCD3_VALUES_enum
{
    PORTMUX_ZCD3_DEFAULT_gv        = 0x00   /* OUT on PA7 */
} PORTMUX_ZCD3_values_t;

/* Zero Cross Detector 3 Output select bit group configurations*/
typedef enum PORTMUX_ZCD3_enum
{
    PORTMUX_ZCD3_DEFAULT_gc        = (PORTMUX_ZCD3_DEFAULT_gv << PORTMUX_ZCD3_bp)   /* OUT on PA7 */
} PORTMUX_ZCD3_t;

