avrdudes/avr-libc/include/avr/ioavr32sd32.h
/*
--------------------------------------------------------------------------
SIGROW - Signature row
--------------------------------------------------------------------------
*/

/* Signature row */
typedef struct SIGROW_struct
{
    register8_t DEVICEID0;  /* Device ID Byte 0 */
    register8_t DEVICEID1;  /* Device ID Byte 1 */
    register8_t DEVICEID2;  /* Device ID Byte 2 */
    register8_t reserved_1[1];
    _WORDREGISTER(TEMPSENSE0);  /* Temperature Calibration 0 */
    _WORDREGISTER(TEMPSENSE1);  /* Temperature Calibration 1 */
    register8_t reserved_2[8];
    register8_t SERNUM0;  /* LOTNUM0 */
    register8_t SERNUM1;  /* LOTNUM1 */
    register8_t SERNUM2;  /* LOTNUM2 */
    register8_t SERNUM3;  /* LOTNUM3 */
    register8_t SERNUM4;  /* LOTNUM4 */
    register8_t SERNUM5;  /* LOTNUM5 */
    register8_t SERNUM6;  /* RANDOM */
    register8_t SERNUM7;  /* SCRIBE */
    register8_t SERNUM8;  /* XPOS0 */
    register8_t SERNUM9;  /* XPOS1 */
    register8_t SERNUM10;  /* YPOS0 */
    register8_t SERNUM11;  /* YPOS1 */
    register8_t SERNUM12;  /* RES0 */
    register8_t SERNUM13;  /* RES1 */
    register8_t SERNUM14;  /* RES2 */
    register8_t SERNUM15;  /* RES3 */
    register8_t reserved_3[96];
} SIGROW_t;


/*
--------------------------------------------------------------------------
SLPCTRL - Sleep Controller
--------------------------------------------------------------------------
*/

/* Sleep Controller */
typedef struct SLPCTRL_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t CTRLB;  /* Control B */
    register8_t VREGCTRL;  /* Voltage Regulator Control */
    register8_t INTCTRL;  /* Interrupt Control */
    register8_t INTFLAGS;  /* Interrup Status */
    register8_t reserved_1[11];
} SLPCTRL_t;

/* VMON Diagnostic Mode select bit group values */
typedef enum SLPCTRL_DMODE_VALUES_enum
{
    SLPCTRL_DMODE_NO_gv            = 0x00,  /* No VMON error should be detected */
    SLPCTRL_DMODE_UNDER_gv         = 0x01,  /* VMON Undervoltage error should be detected */
    SLPCTRL_DMODE_OVER_gv          = 0x02   /* VMON Overvoltage error should be detected */
} SLPCTRL_DMODE_values_t;

/* VMON Diagnostic Mode select bit group configurations*/
typedef enum SLPCTRL_DMODE_enum
{
    SLPCTRL_DMODE_NO_gc            = (SLPCTRL_DMODE_NO_gv << SLPCTRL_DMODE_gp),  /* No VMON error should be detected */
    SLPCTRL_DMODE_UNDER_gc         = (SLPCTRL_DMODE_UNDER_gv << SLPCTRL_DMODE_gp),  /* VMON Undervoltage error should be detected */
    SLPCTRL_DMODE_OVER_gc          = (SLPCTRL_DMODE_OVER_gv << SLPCTRL_DMODE_gp)   /* VMON Overvoltage error should be detected */
} SLPCTRL_DMODE_t;

/* Performance Mode select bit group values */
typedef enum SLPCTRL_PMODE_VALUES_enum
{
    SLPCTRL_PMODE_AUTO_gv          = 0x00,  /* Automatically switch from LDO to to ULP regulator in sleep and when running on 32.768 kHz oscillator */
    SLPCTRL_PMODE_FULL_gv          = 0x01   /* Run on LDO in all modes */
} SLPCTRL_PMODE_values_t;

/* Performance Mode select bit group configurations*/
typedef enum SLPCTRL_PMODE_enum
{
    SLPCTRL_PMODE_AUTO_gc          = (SLPCTRL_PMODE_AUTO_gv << SLPCTRL_PMODE_gp),  /* Automatically switch from LDO to to ULP regulator in sleep and when running on 32.768 kHz oscillator */
    SLPCTRL_PMODE_FULL_gc          = (SLPCTRL_PMODE_FULL_gv << SLPCTRL_PMODE_gp)   /* Run on LDO in all modes */
} SLPCTRL_PMODE_t;

/* Sleep mode select bit group values */
typedef enum SLPCTRL_SMODE_VALUES_enum
{
    SLPCTRL_SMODE_IDLE_gv          = 0x00,  /* Idle mode */
    SLPCTRL_SMODE_STDBY_gv         = 0x01,  /* Standby Mode */
    SLPCTRL_SMODE_PDOWN_gv         = 0x02   /* Power-down Mode */
} SLPCTRL_SMODE_values_t;

/* Sleep mode select bit group configurations*/
typedef enum SLPCTRL_SMODE_enum
{
    SLPCTRL_SMODE_IDLE_gc          = (SLPCTRL_SMODE_IDLE_gv << SLPCTRL_SMODE_gp),  /* Idle mode */
    SLPCTRL_SMODE_STDBY_gc         = (SLPCTRL_SMODE_STDBY_gv << SLPCTRL_SMODE_gp),  /* Standby Mode */
    SLPCTRL_SMODE_PDOWN_gc         = (SLPCTRL_SMODE_PDOWN_gv << SLPCTRL_SMODE_gp)   /* Power-down Mode */
} SLPCTRL_SMODE_t;

#define SLEEP_MODE_IDLE (0x00<<1)
#define SLEEP_MODE_STANDBY (0x01<<1)
#define SLEEP_MODE_PWR_DOWN (0x02<<1)
/* VMON Sleep Mode Enable select bit group values */
typedef enum SLPCTRL_VMONSEN_VALUES_enum
{
    SLPCTRL_VMONSEN_DISABLE_gv     = 0x00,  /* VMON disabled in STANDBY */
    SLPCTRL_VMONSEN_ENABLE_gv      = 0x01   /* VMON enabled in STANDBY */
} SLPCTRL_VMONSEN_values_t;

/* VMON Sleep Mode Enable select bit group configurations*/
typedef enum SLPCTRL_VMONSEN_enum
{
    SLPCTRL_VMONSEN_DISABLE_gc     = (SLPCTRL_VMONSEN_DISABLE_gv << SLPCTRL_VMONSEN_bp),  /* VMON disabled in STANDBY */
    SLPCTRL_VMONSEN_ENABLE_gc      = (SLPCTRL_VMONSEN_ENABLE_gv << SLPCTRL_VMONSEN_bp)   /* VMON enabled in STANDBY */
} SLPCTRL_VMONSEN_t;

/*
--------------------------------------------------------------------------
SPI - Serial Peripheral Interface
--------------------------------------------------------------------------
*/

/* Serial Peripheral Interface */
typedef struct SPI_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t CTRLB;  /* Control B */
    register8_t INTCTRL;  /* Interrupt Control */
    register8_t INTFLAGS;  /* Interrupt Flags */
    register8_t DATA;  /* Data */
    register8_t reserved_1[11];
} SPI_t;

/* SPI Mode select bit group values */
typedef enum SPI_MODE_VALUES_enum
{
    SPI_MODE_0_gv                  = 0x00,  /* SPI Mode 0 */
    SPI_MODE_1_gv                  = 0x01,  /* SPI Mode 1 */
    SPI_MODE_2_gv                  = 0x02,  /* SPI Mode 2 */
    SPI_MODE_3_gv                  = 0x03   /* SPI Mode 3 */
} SPI_MODE_values_t;

/* SPI Mode select bit group configurations*/
typedef enum SPI_MODE_enum
{
    SPI_MODE_0_gc                  = (SPI_MODE_0_gv << SPI_MODE_gp),  /* SPI Mode 0 */
    SPI_MODE_1_gc                  = (SPI_MODE_1_gv << SPI_MODE_gp),  /* SPI Mode 1 */
    SPI_MODE_2_gc                  = (SPI_MODE_2_gv << SPI_MODE_gp),  /* SPI Mode 2 */
    SPI_MODE_3_gc                  = (SPI_MODE_3_gv << SPI_MODE_gp)   /* SPI Mode 3 */
} SPI_MODE_t;

/* Prescaler select bit group values */
typedef enum SPI_PRESC_VALUES_enum
{
    SPI_PRESC_DIV4_gv              = 0x00,  /* CLK_PER / 4 */
    SPI_PRESC_DIV16_gv             = 0x01,  /* CLK_PER / 16 */
    SPI_PRESC_DIV64_gv             = 0x02,  /* CLK_PER / 64 */
    SPI_PRESC_DIV128_gv            = 0x03   /* CLK_PER / 128 */
} SPI_PRESC_values_t;

/* Prescaler select bit group configurations*/
typedef enum SPI_PRESC_enum
{
    SPI_PRESC_DIV4_gc              = (SPI_PRESC_DIV4_gv << SPI_PRESC_gp),  /* CLK_PER / 4 */
    SPI_PRESC_DIV16_gc             = (SPI_PRESC_DIV16_gv << SPI_PRESC_gp),  /* CLK_PER / 16 */
    SPI_PRESC_DIV64_gc             = (SPI_PRESC_DIV64_gv << SPI_PRESC_gp),  /* CLK_PER / 64 */
    SPI_PRESC_DIV128_gc            = (SPI_PRESC_DIV128_gv << SPI_PRESC_gp)   /* CLK_PER / 128 */
} SPI_PRESC_t;

