avrdudes/avr-libc/include/avr/ioavr32sd32.h
/* VPORT (VPORTC) - Virtual Ports */
#define VPORTC_DIR  _SFR_MEM8(0x0008)
#define VPORTC_OUT  _SFR_MEM8(0x0009)
#define VPORTC_IN  _SFR_MEM8(0x000A)
#define VPORTC_INTFLAGS  _SFR_MEM8(0x000B)


/* VPORT (VPORTD) - Virtual Ports */
#define VPORTD_DIR  _SFR_MEM8(0x000C)
#define VPORTD_OUT  _SFR_MEM8(0x000D)
#define VPORTD_IN  _SFR_MEM8(0x000E)
#define VPORTD_INTFLAGS  _SFR_MEM8(0x000F)


/* VPORT (VPORTF) - Virtual Ports */
#define VPORTF_DIR  _SFR_MEM8(0x0014)
#define VPORTF_OUT  _SFR_MEM8(0x0015)
#define VPORTF_IN  _SFR_MEM8(0x0016)
#define VPORTF_INTFLAGS  _SFR_MEM8(0x0017)


/* GPR - General Purpose Registers */
#define GPR_GPR0  _SFR_MEM8(0x001C)
#define GPR_GPR1  _SFR_MEM8(0x001D)
#define GPR_GPR2  _SFR_MEM8(0x001E)
#define GPR_GPR3  _SFR_MEM8(0x001F)


/* CPU - CPU */
#define CPU_SPLIM  _SFR_MEM16(0x0030)
#define CPU_SPLIML  _SFR_MEM8(0x0030)
#define CPU_SPLIMH  _SFR_MEM8(0x0031)
#define CPU_CCP  _SFR_MEM8(0x0034)
#define CPU_CTRLA  _SFR_MEM8(0x0035)
#define CPU_INTFLAGS  _SFR_MEM8(0x0036)
#define CPU_SP  _SFR_MEM16(0x003D)
#define CPU_SPL  _SFR_MEM8(0x003D)
#define CPU_SPH  _SFR_MEM8(0x003E)
#define CPU_SREG  _SFR_MEM8(0x003F)


/* RSTCTRL - Reset controller */
#define RSTCTRL_RSTFR  _SFR_MEM8(0x0040)
#define RSTCTRL_SWRR  _SFR_MEM8(0x0041)
#define RSTCTRL_MCFLAGSA  _SFR_MEM8(0x0042)
#define RSTCTRL_MCFLAGSB  _SFR_MEM8(0x0043)


/* SLPCTRL - Sleep Controller */
#define SLPCTRL_CTRLA  _SFR_MEM8(0x0050)
#define SLPCTRL_CTRLB  _SFR_MEM8(0x0051)
#define SLPCTRL_VREGCTRL  _SFR_MEM8(0x0052)
#define SLPCTRL_INTCTRL  _SFR_MEM8(0x0053)
#define SLPCTRL_INTFLAGS  _SFR_MEM8(0x0054)


/* BOD - Bod interface */
#define BOD_CTRLA  _SFR_MEM8(0x0060)
#define BOD_CTRLB  _SFR_MEM8(0x0061)
#define BOD_VLMCTRLA  _SFR_MEM8(0x0068)
#define BOD_INTCTRL  _SFR_MEM8(0x0069)
#define BOD_INTFLAGS  _SFR_MEM8(0x006A)
#define BOD_STATUS  _SFR_MEM8(0x006B)


/* VREF - Voltage Reference */
#define VREF_DAC0REF  _SFR_MEM8(0x0072)
#define VREF_ACREF  _SFR_MEM8(0x0074)


/* CLKCTRL - Clock controller */
#define CLKCTRL_MCLKCTRLA  _SFR_MEM8(0x0080)
#define CLKCTRL_MCLKCTRLB  _SFR_MEM8(0x0081)
#define CLKCTRL_MCLKCTRLC  _SFR_MEM8(0x0082)
#define CLKCTRL_MCLKINTCTRL  _SFR_MEM8(0x0083)
#define CLKCTRL_MCLKINTFLAGS  _SFR_MEM8(0x0084)
#define CLKCTRL_MCLKSTATUS  _SFR_MEM8(0x0085)
#define CLKCTRL_MCLKTIMEBASE  _SFR_MEM8(0x0086)
#define CLKCTRL_MCLKCFD0CTRLA  _SFR_MEM8(0x0088)
#define CLKCTRL_MCLKCFD1CTRLA  _SFR_MEM8(0x0089)
#define CLKCTRL_MCLKCFM0VALUE  _SFR_MEM16(0x0090)
#define CLKCTRL_MCLKCFM0VALUEL  _SFR_MEM8(0x0090)
#define CLKCTRL_MCLKCFM0VALUEH  _SFR_MEM8(0x0091)
#define CLKCTRL_MCLKCFM0WINLT  _SFR_MEM16(0x0092)
#define CLKCTRL_MCLKCFM0WINLTL  _SFR_MEM8(0x0092)
#define CLKCTRL_MCLKCFM0WINLTH  _SFR_MEM8(0x0093)
#define CLKCTRL_MCLKCFM0WINHT  _SFR_MEM16(0x0094)
#define CLKCTRL_MCLKCFM0WINHTL  _SFR_MEM8(0x0094)
#define CLKCTRL_MCLKCFM0WINHTH  _SFR_MEM8(0x0095)
#define CLKCTRL_MCLKCFM0REFNUM  _SFR_MEM16(0x0096)
#define CLKCTRL_MCLKCFM0REFNUML  _SFR_MEM8(0x0096)
#define CLKCTRL_MCLKCFM0REFNUMH  _SFR_MEM8(0x0097)
#define CLKCTRL_MCLKCFM0CTRLA  _SFR_MEM8(0x0098)
#define CLKCTRL_MCLKCFM0CTRLB  _SFR_MEM8(0x0099)
#define CLKCTRL_MCLKCFM1VALUE  _SFR_MEM16(0x00A0)
#define CLKCTRL_MCLKCFM1VALUEL  _SFR_MEM8(0x00A0)
#define CLKCTRL_MCLKCFM1VALUEH  _SFR_MEM8(0x00A1)
#define CLKCTRL_MCLKCFM1WINLT  _SFR_MEM16(0x00A2)
#define CLKCTRL_MCLKCFM1WINLTL  _SFR_MEM8(0x00A2)
#define CLKCTRL_MCLKCFM1WINLTH  _SFR_MEM8(0x00A3)
#define CLKCTRL_MCLKCFM1WINHT  _SFR_MEM16(0x00A4)
#define CLKCTRL_MCLKCFM1WINHTL  _SFR_MEM8(0x00A4)
#define CLKCTRL_MCLKCFM1WINHTH  _SFR_MEM8(0x00A5)
#define CLKCTRL_MCLKCFM1REFNUM  _SFR_MEM16(0x00A6)
#define CLKCTRL_MCLKCFM1REFNUML  _SFR_MEM8(0x00A6)
#define CLKCTRL_MCLKCFM1REFNUMH  _SFR_MEM8(0x00A7)
#define CLKCTRL_MCLKCFM1CTRLA  _SFR_MEM8(0x00A8)
#define CLKCTRL_MCLKCFM1CTRLB  _SFR_MEM8(0x00A9)
#define CLKCTRL_OSCHFCTRLA  _SFR_MEM8(0x00C0)
#define CLKCTRL_OSCHFTUNE  _SFR_MEM8(0x00C1)
#define CLKCTRL_PLLCTRLA  _SFR_MEM8(0x00C8)
#define CLKCTRL_OSC32KCTRLA  _SFR_MEM8(0x00D0)
#define CLKCTRL_XOSC32KCTRLA  _SFR_MEM8(0x00D4)
#define CLKCTRL_XOSCHFCTRLA  _SFR_MEM8(0x00D8)


/* MVIO - Multi-Voltage I/O */
#define MVIO_INTCTRL  _SFR_MEM8(0x0100)
#define MVIO_INTFLAGS  _SFR_MEM8(0x0101)
#define MVIO_STATUS  _SFR_MEM8(0x0102)


/* WDT - Watchdog Timer */
#define WDT_CTRLA  _SFR_MEM8(0x0110)
#define WDT_CTRLB  _SFR_MEM8(0x0111)
#define WDT_STATUS  _SFR_MEM8(0x0112)
#define WDT_CNT  _SFR_MEM16(0x0114)
#define WDT_CNTL  _SFR_MEM8(0x0114)
#define WDT_CNTH  _SFR_MEM8(0x0115)


/* CPUINT - Interrupt Controller */
#define CPUINT_CTRLA  _SFR_MEM8(0x0120)
#define CPUINT_STATUS  _SFR_MEM8(0x0121)
#define CPUINT_LVL0PRI  _SFR_MEM8(0x0122)
#define CPUINT_LVL1VEC  _SFR_MEM8(0x0123)


/* CRCSCAN - CRCSCAN */
#define CRCSCAN_CTRLA  _SFR_MEM8(0x0130)
#define CRCSCAN_CTRLB  _SFR_MEM8(0x0131)
#define CRCSCAN_INTCTRL  _SFR_MEM8(0x0132)
#define CRCSCAN_INTFLAGS  _SFR_MEM8(0x0133)
#define CRCSCAN_STATUSA  _SFR_MEM8(0x0134)
#define CRCSCAN_SCANADR  _SFR_MEM8(0x0135)
#define CRCSCAN_DATA  _SFR_MEM8(0x0136)
#define CRCSCAN_CRC  _SFR_MEM32(0x0138)
#define CRCSCAN_CRC0  _SFR_MEM8(0x0138)
#define CRCSCAN_CRC1  _SFR_MEM8(0x0139)
#define CRCSCAN_CRC2  _SFR_MEM8(0x013A)
#define CRCSCAN_CRC3  _SFR_MEM8(0x013B)


/* RTC - Real-Time Counter */
#define RTC_CTRLA  _SFR_MEM8(0x0140)
#define RTC_STATUS  _SFR_MEM8(0x0141)
#define RTC_INTCTRL  _SFR_MEM8(0x0142)
#define RTC_INTFLAGS  _SFR_MEM8(0x0143)
#define RTC_TEMP  _SFR_MEM8(0x0144)
#define RTC_DBGCTRL  _SFR_MEM8(0x0145)
#define RTC_CLKSEL  _SFR_MEM8(0x0147)
#define RTC_CNT  _SFR_MEM16(0x0148)
#define RTC_CNTL  _SFR_MEM8(0x0148)
#define RTC_CNTH  _SFR_MEM8(0x0149)
#define RTC_PER  _SFR_MEM16(0x014A)
#define RTC_PERL  _SFR_MEM8(0x014A)
#define RTC_PERH  _SFR_MEM8(0x014B)
#define RTC_CMP  _SFR_MEM16(0x014C)
#define RTC_CMPL  _SFR_MEM8(0x014C)
#define RTC_CMPH  _SFR_MEM8(0x014D)
#define RTC_PITCTRLA  _SFR_MEM8(0x0150)
#define RTC_PITSTATUS  _SFR_MEM8(0x0151)
#define RTC_PITINTCTRL  _SFR_MEM8(0x0152)
#define RTC_PITINTFLAGS  _SFR_MEM8(0x0153)
#define RTC_PITDBGCTRL  _SFR_MEM8(0x0155)
#define RTC_PITEVGENCTRLA  _SFR_MEM8(0x0156)


/* CCL - Configurable Custom Logic */
#define CCL_CTRLA  _SFR_MEM8(0x01C0)
#define CCL_SEQCTRL0  _SFR_MEM8(0x01C1)
#define CCL_SEQCTRL1  _SFR_MEM8(0x01C2)
#define CCL_SEQCTRL2  _SFR_MEM8(0x01C3)
#define CCL_INTCTRL0  _SFR_MEM8(0x01C5)
#define CCL_INTCTRL1  _SFR_MEM8(0x01C6)
#define CCL_INTFLAGS  _SFR_MEM8(0x01C7)
#define CCL_LUT0CTRLA  _SFR_MEM8(0x01C8)
#define CCL_LUT0CTRLB  _SFR_MEM8(0x01C9)
#define CCL_LUT0CTRLC  _SFR_MEM8(0x01CA)
#define CCL_TRUTH0  _SFR_MEM8(0x01CB)
#define CCL_LUT1CTRLA  _SFR_MEM8(0x01CC)
#define CCL_LUT1CTRLB  _SFR_MEM8(0x01CD)
#define CCL_LUT1CTRLC  _SFR_MEM8(0x01CE)
#define CCL_TRUTH1  _SFR_MEM8(0x01CF)
#define CCL_LUT2CTRLA  _SFR_MEM8(0x01D0)
#define CCL_LUT2CTRLB  _SFR_MEM8(0x01D1)
#define CCL_LUT2CTRLC  _SFR_MEM8(0x01D2)
#define CCL_TRUTH2  _SFR_MEM8(0x01D3)
#define CCL_LUT3CTRLA  _SFR_MEM8(0x01D4)
#define CCL_LUT3CTRLB  _SFR_MEM8(0x01D5)
#define CCL_LUT3CTRLC  _SFR_MEM8(0x01D6)
#define CCL_TRUTH3  _SFR_MEM8(0x01D7)
#define CCL_LUT4CTRLA  _SFR_MEM8(0x01D8)
#define CCL_LUT4CTRLB  _SFR_MEM8(0x01D9)
#define CCL_LUT4CTRLC  _SFR_MEM8(0x01DA)
#define CCL_TRUTH4  _SFR_MEM8(0x01DB)
#define CCL_LUT5CTRLA  _SFR_MEM8(0x01DC)
#define CCL_LUT5CTRLB  _SFR_MEM8(0x01DD)
#define CCL_LUT5CTRLC  _SFR_MEM8(0x01DE)
#define CCL_TRUTH5  _SFR_MEM8(0x01DF)


/* EVSYS - Event System */
#define EVSYS_SWEVENTA  _SFR_MEM8(0x0200)
#define EVSYS_CHANNEL0  _SFR_MEM8(0x0210)
#define EVSYS_CHANNEL1  _SFR_MEM8(0x0211)
#define EVSYS_CHANNEL2  _SFR_MEM8(0x0212)
#define EVSYS_CHANNEL3  _SFR_MEM8(0x0213)
#define EVSYS_CHANNEL4  _SFR_MEM8(0x0214)
#define EVSYS_CHANNEL5  _SFR_MEM8(0x0215)
#define EVSYS_USERCCLLUT0A  _SFR_MEM8(0x0220)
#define EVSYS_USERCCLLUT0B  _SFR_MEM8(0x0221)
#define EVSYS_USERCCLLUT1A  _SFR_MEM8(0x0222)
#define EVSYS_USERCCLLUT1B  _SFR_MEM8(0x0223)
#define EVSYS_USERCCLLUT2A  _SFR_MEM8(0x0224)
#define EVSYS_USERCCLLUT2B  _SFR_MEM8(0x0225)
#define EVSYS_USERCCLLUT3A  _SFR_MEM8(0x0226)
#define EVSYS_USERCCLLUT3B  _SFR_MEM8(0x0227)
#define EVSYS_USERCCLLUT4A  _SFR_MEM8(0x0228)
#define EVSYS_USERCCLLUT4B  _SFR_MEM8(0x0229)
#define EVSYS_USERCCLLUT5A  _SFR_MEM8(0x022A)
#define EVSYS_USERCCLLUT5B  _SFR_MEM8(0x022B)
#define EVSYS_USERADC0START  _SFR_MEM8(0x022C)
#define EVSYS_USERADC1START  _SFR_MEM8(0x022D)
#define EVSYS_USEREVSYSEVOUTA  _SFR_MEM8(0x022E)
#define EVSYS_USEREVSYSEVOUTC  _SFR_MEM8(0x022F)
#define EVSYS_USEREVSYSEVOUTD  _SFR_MEM8(0x0230)
#define EVSYS_USEREVSYSEVOUTF  _SFR_MEM8(0x0231)
#define EVSYS_USERUSART0IRDA  _SFR_MEM8(0x0232)
#define EVSYS_USERUSART1IRDA  _SFR_MEM8(0x0233)
#define EVSYS_USERUSART2IRDA  _SFR_MEM8(0x0234)
#define EVSYS_USERTCA0CNTA  _SFR_MEM8(0x0235)
#define EVSYS_USERTCA0CNTB  _SFR_MEM8(0x0236)
#define EVSYS_USERTCB0CAPT  _SFR_MEM8(0x0237)
#define EVSYS_USERTCB0COUNT  _SFR_MEM8(0x0238)
#define EVSYS_USERTCB1CAPT  _SFR_MEM8(0x0239)
#define EVSYS_USERTCB1COUNT  _SFR_MEM8(0x023A)
#define EVSYS_USERTCB2CAPT  _SFR_MEM8(0x023B)
#define EVSYS_USERTCB2COUNT  _SFR_MEM8(0x023C)
#define EVSYS_USERTCB3CAPT  _SFR_MEM8(0x023D)
#define EVSYS_USERTCB3COUNT  _SFR_MEM8(0x023E)
#define EVSYS_USERTCD0INPUTA  _SFR_MEM8(0x023F)
#define EVSYS_USERTCD0INPUTB  _SFR_MEM8(0x0240)
#define EVSYS_USERERRCTRLEVENT0  _SFR_MEM8(0x0241)
#define EVSYS_USERERRCTRLEVENT1  _SFR_MEM8(0x0242)
#define EVSYS_USERCLKCTRLCFD  _SFR_MEM8(0x0243)
#define EVSYS_USERCLKCTRLCFM  _SFR_MEM8(0x0244)


/* PORT (PORTA) - I/O Ports */
#define PORTA_DIR  _SFR_MEM8(0x0400)
#define PORTA_DIRSET  _SFR_MEM8(0x0401)
#define PORTA_DIRCLR  _SFR_MEM8(0x0402)
#define PORTA_DIRTGL  _SFR_MEM8(0x0403)
#define PORTA_OUT  _SFR_MEM8(0x0404)
#define PORTA_OUTSET  _SFR_MEM8(0x0405)
#define PORTA_OUTCLR  _SFR_MEM8(0x0406)
#define PORTA_OUTTGL  _SFR_MEM8(0x0407)
#define PORTA_IN  _SFR_MEM8(0x0408)
#define PORTA_INTFLAGS  _SFR_MEM8(0x0409)
#define PORTA_PORTCTRL  _SFR_MEM8(0x040A)
#define PORTA_PINCONFIG  _SFR_MEM8(0x040B)
#define PORTA_PINCTRLUPD  _SFR_MEM8(0x040C)
#define PORTA_PINCTRLSET  _SFR_MEM8(0x040D)
#define PORTA_PINCTRLCLR  _SFR_MEM8(0x040E)
#define PORTA_PIN0CTRL  _SFR_MEM8(0x0410)
#define PORTA_PIN1CTRL  _SFR_MEM8(0x0411)
#define PORTA_PIN2CTRL  _SFR_MEM8(0x0412)
#define PORTA_PIN3CTRL  _SFR_MEM8(0x0413)
#define PORTA_PIN4CTRL  _SFR_MEM8(0x0414)
#define PORTA_PIN5CTRL  _SFR_MEM8(0x0415)
#define PORTA_PIN6CTRL  _SFR_MEM8(0x0416)
#define PORTA_PIN7CTRL  _SFR_MEM8(0x0417)
#define PORTA_EVGENCTRLA  _SFR_MEM8(0x0418)


