avrdudes/avr-libc/include/avr/ioavr32sd32.h
/* SYSCFG - System Configuration Registers */
#define SYSCFG_REVID  _SFR_MEM8(0x0F01)


/* NVMCTRL - Non-volatile Memory Controller */
#define NVMCTRL_CTRLA  _SFR_MEM8(0x1000)
#define NVMCTRL_CTRLB  _SFR_MEM8(0x1001)
#define NVMCTRL_CTRLC  _SFR_MEM8(0x1002)
#define NVMCTRL_CTRLD  _SFR_MEM8(0x1003)
#define NVMCTRL_INTCTRLA  _SFR_MEM8(0x1004)
#define NVMCTRL_INTFLAGSA  _SFR_MEM8(0x1005)
#define NVMCTRL_INTFLAGSB  _SFR_MEM8(0x1006)
#define NVMCTRL_STATUS  _SFR_MEM8(0x1007)
#define NVMCTRL_DATA  _SFR_MEM32(0x1008)
#define NVMCTRL_DATA0  _SFR_MEM8(0x1008)
#define NVMCTRL_DATA1  _SFR_MEM8(0x1009)
#define NVMCTRL_DATA2  _SFR_MEM8(0x100A)
#define NVMCTRL_DATA3  _SFR_MEM8(0x100B)
#define NVMCTRL_ADDR  _SFR_MEM32(0x100C)
#define NVMCTRL_ADDR0  _SFR_MEM8(0x100C)
#define NVMCTRL_ADDR1  _SFR_MEM8(0x100D)
#define NVMCTRL_ADDR2  _SFR_MEM8(0x100E)
#define NVMCTRL_ADDR3  _SFR_MEM8(0x100F)
#define NVMCTRL_PARITY  _SFR_MEM8(0x1010)
#define NVMCTRL_SYNDROME  _SFR_MEM8(0x1011)


/* LOCK - Lockbits */
#define LOCK_KEY  _SFR_MEM32(0x1040)
#define LOCK_KEY0  _SFR_MEM8(0x1040)
#define LOCK_KEY1  _SFR_MEM8(0x1041)
#define LOCK_KEY2  _SFR_MEM8(0x1042)
#define LOCK_KEY3  _SFR_MEM8(0x1043)


/* FUSE - Fuses */
#define FUSE_WDTCFG  _SFR_MEM8(0x1050)
#define FUSE_BODCFG  _SFR_MEM8(0x1051)
#define FUSE_SYSCFG0  _SFR_MEM8(0x1055)
#define FUSE_SYSCFG1  _SFR_MEM8(0x1056)
#define FUSE_CODESIZE  _SFR_MEM8(0x1057)
#define FUSE_BOOTSIZE  _SFR_MEM8(0x1058)
#define FUSE_PDICFG  _SFR_MEM16(0x105A)
#define FUSE_PDICFGL  _SFR_MEM8(0x105A)
#define FUSE_PDICFGH  _SFR_MEM8(0x105B)


/* SIGROW - Signature row */
#define SIGROW_DEVICEID0  _SFR_MEM8(0x1080)
#define SIGROW_DEVICEID1  _SFR_MEM8(0x1081)
#define SIGROW_DEVICEID2  _SFR_MEM8(0x1082)
#define SIGROW_TEMPSENSE0  _SFR_MEM16(0x1084)
#define SIGROW_TEMPSENSE0L  _SFR_MEM8(0x1084)
#define SIGROW_TEMPSENSE0H  _SFR_MEM8(0x1085)
#define SIGROW_TEMPSENSE1  _SFR_MEM16(0x1086)
#define SIGROW_TEMPSENSE1L  _SFR_MEM8(0x1086)
#define SIGROW_TEMPSENSE1H  _SFR_MEM8(0x1087)
#define SIGROW_SERNUM0  _SFR_MEM8(0x1090)
#define SIGROW_SERNUM1  _SFR_MEM8(0x1091)
#define SIGROW_SERNUM2  _SFR_MEM8(0x1092)
#define SIGROW_SERNUM3  _SFR_MEM8(0x1093)
#define SIGROW_SERNUM4  _SFR_MEM8(0x1094)
#define SIGROW_SERNUM5  _SFR_MEM8(0x1095)
#define SIGROW_SERNUM6  _SFR_MEM8(0x1096)
#define SIGROW_SERNUM7  _SFR_MEM8(0x1097)
#define SIGROW_SERNUM8  _SFR_MEM8(0x1098)
#define SIGROW_SERNUM9  _SFR_MEM8(0x1099)
#define SIGROW_SERNUM10  _SFR_MEM8(0x109A)
#define SIGROW_SERNUM11  _SFR_MEM8(0x109B)
#define SIGROW_SERNUM12  _SFR_MEM8(0x109C)
#define SIGROW_SERNUM13  _SFR_MEM8(0x109D)
#define SIGROW_SERNUM14  _SFR_MEM8(0x109E)
#define SIGROW_SERNUM15  _SFR_MEM8(0x109F)


/* BOOTROW - Boot Row */
#define BOOTROW_BOOTROW  _SFR_MEM8(0x1100)


/* USERROW - User Row */
#define USERROW_USERROW  _SFR_MEM8(0x1200)




/* ========== Generic Port Pins ========== */
#define PIN0_bm 0x01
#define PIN0_bp 0
#define PIN1_bm 0x02
#define PIN1_bp 1
#define PIN2_bm 0x04
#define PIN2_bp 2
#define PIN3_bm 0x08
#define PIN3_bp 3
#define PIN4_bm 0x10
#define PIN4_bp 4
#define PIN5_bm 0x20
#define PIN5_bp 5
#define PIN6_bm 0x40
#define PIN6_bp 6
#define PIN7_bm 0x80
#define PIN7_bp 7

/* ========== Interrupt Vector Definitions ========== */
/* Vector 0 is the reset vector */

/* NMI interrupt vectors */
#define NMI_vect_num  1
#define NMI_vect      _VECTOR(1)  /*  */

/* BOD interrupt vectors */
#define BOD_VLM_vect_num  2
#define BOD_VLM_vect      _VECTOR(2)  /*  */

/* ERRCTRL interrupt vectors */
#define ERRCTRL_INT_vect_num  3
#define ERRCTRL_INT_vect      _VECTOR(3)  /*  */

/* CLKCTRL interrupt vectors */
#define CLKCTRL_INT_vect_num  4
#define CLKCTRL_INT_vect      _VECTOR(4)  /*  */

/* SLPCTRL interrupt vectors */
#define SLPCTRL_INT_vect_num  5
#define SLPCTRL_INT_vect      _VECTOR(5)  /*  */

/* SWDT interrupt vectors */
#define SWDT_INT_vect_num  6
#define SWDT_INT_vect      _VECTOR(6)  /*  */

/* NVMCTRL interrupt vectors */
#define NVMCTRL_ERROR_vect_num  7
#define NVMCTRL_ERROR_vect      _VECTOR(7)  /*  */

/* RAMCTRL interrupt vectors */
#define RAMCTRL_INT_vect_num  8
#define RAMCTRL_INT_vect      _VECTOR(8)  /*  */

/* CRCSCAN interrupt vectors */
#define CRCSCAN_INT_vect_num  9
#define CRCSCAN_INT_vect      _VECTOR(9)  /*  */

/* MVIO interrupt vectors */
#define MVIO_MVIO_vect_num  10
#define MVIO_MVIO_vect      _VECTOR(10)  /*  */

/* RTC interrupt vectors */
#define RTC_CNT_vect_num  11
#define RTC_CNT_vect      _VECTOR(11)  /*  */
#define RTC_PIT_vect_num  12
#define RTC_PIT_vect      _VECTOR(12)  /*  */

/* CCL interrupt vectors */
#define CCL_CCL_vect_num  13
#define CCL_CCL_vect      _VECTOR(13)  /*  */

/* PORTA interrupt vectors */
#define PORTA_PORT_vect_num  14
#define PORTA_PORT_vect      _VECTOR(14)  /*  */

/* TCA0 interrupt vectors */
#define TCA0_OVF_vect_num  15
#define TCA0_OVF_vect      _VECTOR(15)  /*  */
#define TCA0_HUNF_vect_num  16
#define TCA0_HUNF_vect      _VECTOR(16)  /*  */
#define TCA0_CMP0_vect_num  17
#define TCA0_CMP0_vect      _VECTOR(17)  /*  */
#define TCA0_CMP1_vect_num  18
#define TCA0_CMP1_vect      _VECTOR(18)  /*  */
#define TCA0_CMP2_vect_num  19
#define TCA0_CMP2_vect      _VECTOR(19)  /*  */

/* TCB0 interrupt vectors */
#define TCB0_INT_vect_num  20
#define TCB0_INT_vect      _VECTOR(20)  /*  */

/* TCB1 interrupt vectors */
#define TCB1_INT_vect_num  21
#define TCB1_INT_vect      _VECTOR(21)  /*  */

/* TCD0 interrupt vectors */
#define TCD0_OVF_vect_num  22
#define TCD0_OVF_vect      _VECTOR(22)  /*  */
#define TCD0_TRIG_vect_num  23
#define TCD0_TRIG_vect      _VECTOR(23)  /*  */

/* TWI0 interrupt vectors */
#define TWI0_TWIS_vect_num  24
#define TWI0_TWIS_vect      _VECTOR(24)  /*  */
#define TWI0_TWIM_vect_num  25
#define TWI0_TWIM_vect      _VECTOR(25)  /*  */

/* SPI0 interrupt vectors */
#define SPI0_INT_vect_num  26
#define SPI0_INT_vect      _VECTOR(26)  /*  */

/* SPI1 interrupt vectors */
#define SPI1_INT_vect_num  27
#define SPI1_INT_vect      _VECTOR(27)  /*  */

/* USART0 interrupt vectors */
#define USART0_RXC_vect_num  28
#define USART0_RXC_vect      _VECTOR(28)  /*  */
#define USART0_DRE_vect_num  29
#define USART0_DRE_vect      _VECTOR(29)  /*  */
#define USART0_TXC_vect_num  30
#define USART0_TXC_vect      _VECTOR(30)  /*  */

/* PORTD interrupt vectors */
#define PORTD_PORT_vect_num  31
#define PORTD_PORT_vect      _VECTOR(31)  /*  */

/* AC0 interrupt vectors */
#define AC0_AC_vect_num  32
#define AC0_AC_vect      _VECTOR(32)  /*  */

/* AC1 interrupt vectors */
#define AC1_AC_vect_num  33
#define AC1_AC_vect      _VECTOR(33)  /*  */

/* AC2 interrupt vectors */
#define AC2_AC_vect_num  34
#define AC2_AC_vect      _VECTOR(34)  /*  */

